## PANDAS: INTRODUCTION

### PANDAS: Data Manipulation

> It is often said that 80% of data analysis is spent on data cleaning and preparing data. To get a handle on the problem, this section focuses on a small, but important aspect of data manipulation and cleaning with Pandas.

### PANDAS: Data Structures

*There are two different data structures are there in Pandas -*

* **Series -** It is a one-dimensional labeled array capable of holding any data type (e.g. integer, string, floating point number, Python objects etc.). The axis are collectively referred to as the index.

* **Data Frame -** It is a two-dimensional labeled data structure with columns of potentially different types. We can think of it like a spreadsheet or SQL table, or a Series of objects.

### PANDAS: Series Data Structure

**Definition of Series data structure -**

pandas.core.series.Series(data, index, dtype, copy)

**data:** data takes various forms like ndarray, list, constants etc.<br>
**index:** it is unique and hashable for easy identification<br>
**dtype:** it is for data type<br>
**copy:** only affects when Series is getting defined from one dimensional ndarray<br>

In [1]:
# importing required modules
import pandas as pd
import numpy as np

In [2]:
# creating empty Series
s = pd.Series()
print (s, len(s), type(s), id(s))

Series([], dtype: float64) 0 <class 'pandas.core.series.Series'> 2352315024816

<ipython-input-2-812467d8dfd0>:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s = pd.Series()

In [3]:
# creating Series from ndarray
nddata = np.array(['aaa', 'bbb', 'ccc', 'ddd'])
print (nddata, type(nddata))
s = pd.Series(data = nddata)
print (s, type(s))

['aaa' 'bbb' 'ccc' 'ddd'] <class 'numpy.ndarray'>
0    aaa
1    bbb
2    ccc
3    ddd
dtype: object <class 'pandas.core.series.Series'>

In [4]:
nddata = np.array([100, 200, 400, 500, 350])
print (nddata, type(nddata))
s = pd.Series(data = nddata, copy = False)
print (s, type(s))
nddata[2] = 99999
print (nddata, type(nddata))
print (s, type(s))

[100 200 400 500 350] <class 'numpy.ndarray'>
0    100
1    200
2    400
3    500
4    350
dtype: int32 <class 'pandas.core.series.Series'>
[  100   200 99999   500   350] <class 'numpy.ndarray'>
0      100
1      200
2    99999
3      500
4      350
dtype: int32 <class 'pandas.core.series.Series'>

In [5]:
nddata = np.array([100, 200, 400, 500, 350])
print (nddata, type(nddata))
s = pd.Series(data = nddata, copy = True)
print (s, type(s))
nddata[2] = 99999
print (nddata, type(nddata))
print (s, type(s))

[100 200 400 500 350] <class 'numpy.ndarray'>
0    100
1    200
2    400
3    500
4    350
dtype: int32 <class 'pandas.core.series.Series'>
[  100   200 99999   500   350] <class 'numpy.ndarray'>
0    100
1    200
2    400
3    500
4    350
dtype: int32 <class 'pandas.core.series.Series'>

In [6]:
nddata = np.array(['aaa', 'bbb', 'ccc', 'ddd', 'eee', 'fff', 'ggg'])
print (nddata, type(nddata))
s = pd.Series(data = nddata, index = [100, 101, 130, 120, 101, 303, 404])
print (s, type(s))
print (s[100])
print (s[101])
print (s[404])

['aaa' 'bbb' 'ccc' 'ddd' 'eee' 'fff' 'ggg'] <class 'numpy.ndarray'>
100    aaa
101    bbb
130    ccc
120    ddd
101    eee
303    fff
404    ggg
dtype: object <class 'pandas.core.series.Series'>
aaa
101    bbb
101    eee
dtype: object
ggg

In [7]:
nddata = np.array(['aaa', 'bbb', 'ccc', 'ddd', 'eee', 'fff', 'ggg'])
print (nddata, type(nddata))
s = pd.Series(data = nddata, index = ['a', 'b', 'd', 'c', 'h', 'e', 'y'])
print (s, type(s))
print (s[0], s['a'])
print (s[1], s['b'])
print (s[4], s['h'])

['aaa' 'bbb' 'ccc' 'ddd' 'eee' 'fff' 'ggg'] <class 'numpy.ndarray'>
a    aaa
b    bbb
d    ccc
c    ddd
h    eee
e    fff
y    ggg
dtype: object <class 'pandas.core.series.Series'>
aaa aaa
bbb bbb
eee eee

In [8]:
# creating Series from dictionary
dictdata = {'apple':100, 'banana':220, 'orange':450, 'pineapple':320}
print (dictdata, type(dictdata))
s = pd.Series(data = dictdata)
print (s, type(s))

{'apple': 100, 'banana': 220, 'orange': 450, 'pineapple': 320} <class 'dict'>
apple        100
banana       220
orange       450
pineapple    320
dtype: int64 <class 'pandas.core.series.Series'>

In [9]:
dictdata = {'apple':100, 'banana':220, 'orange':450, 'pineapple':320}
print (dictdata, type(dictdata))
s = pd.Series(data = dictdata, index = ['apple', 'orange', 'orange', 'apple', 'orange', 'pineapple', 'banana'])
print (s, type(s))
print (s['banana'])
print (s['orange'])
print (s['apple'])

{'apple': 100, 'banana': 220, 'orange': 450, 'pineapple': 320} <class 'dict'>
apple        100
orange       450
orange       450
apple        100
orange       450
pineapple    320
banana       220
dtype: int64 <class 'pandas.core.series.Series'>
220
orange    450
orange    450
orange    450
dtype: int64
apple    100
apple    100
dtype: int64

In [10]:
# creating Series from scaler
s = pd.Series(data = 5, index = [0, 1, 2, 3, 4, 5, 6])
print (s, type(s))

0    5
1    5
2    5
3    5
4    5
5    5
6    5
dtype: int64 <class 'pandas.core.series.Series'>

In [11]:
# creating Series from list
listdata = ['Monday', 'Friday', 'Saturday', 'Tuesday']
print (listdata, type(listdata))
s = pd.Series(data = listdata)
print (s, type(s))
s = pd.Series(data = listdata, index = ['1st', '2nd', '3rd', '4th'])
print (s, type(s))
s = pd.Series(data = listdata, index = ['3rd', '1st', '4th', '2nd'])
print (s, type(s))
print (s.sort_values())
print (s.sort_index())

['Monday', 'Friday', 'Saturday', 'Tuesday'] <class 'list'>
0      Monday
1      Friday
2    Saturday
3     Tuesday
dtype: object <class 'pandas.core.series.Series'>
1st      Monday
2nd      Friday
3rd    Saturday
4th     Tuesday
dtype: object <class 'pandas.core.series.Series'>
3rd      Monday
1st      Friday
4th    Saturday
2nd     Tuesday
dtype: object <class 'pandas.core.series.Series'>
1st      Friday
3rd      Monday
4th    Saturday
2nd     Tuesday
dtype: object
1st      Friday
2nd     Tuesday
3rd      Monday
4th    Saturday
dtype: object

In [12]:
listdata = ['Monday', 'Friday', 'Saturday', 'Tuesday', 'Wednesday', 'Sunday']
print (listdata, type(listdata))
s = pd.Series(data = listdata)
print (s, type(s))
print (s[2])
print (s[:3])
print (s[3:])
print (s[2:4])

['Monday', 'Friday', 'Saturday', 'Tuesday', 'Wednesday', 'Sunday'] <class 'list'>
0       Monday
1       Friday
2     Saturday
3      Tuesday
4    Wednesday
5       Sunday
dtype: object <class 'pandas.core.series.Series'>
Saturday
0      Monday
1      Friday
2    Saturday
dtype: object
3      Tuesday
4    Wednesday
5       Sunday
dtype: object
2    Saturday
3     Tuesday
dtype: object

### PANDAS: Data Frame Structure

### Create Data Frame

In [13]:
column_names = ['name', 'age', 'gender', 'job']
data_list = [['alice', 19, 'F', 'student'], ['john', 26, 'M', 'student']]   # list of lists
user1 = pd.DataFrame(data = data_list, columns = column_names)
user1

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student

In [14]:
data_dict = {'name':['eric', 'paul'], 'age':[22, 58], 'gender':['M', 'F'], 'job':['student', 'manager']}   # dictionary
print (data_dict)
user2 = pd.DataFrame(data = data_dict)
user2

{'name': ['eric', 'paul'], 'age': [22, 58], 'gender': ['M', 'F'], 'job': ['student', 'manager']}

   name  age gender      job
0  eric   22      M  student
1  paul   58      F  manager

In [15]:
data_dict = dict(name = ['peter', 'julie'], age = [33, 44], gender = ['M', 'F'], job = ['engineer', 'scientist'])   # dictionary
print (data_dict)
user3 = pd.DataFrame(data = data_dict)
user3

{'name': ['peter', 'julie'], 'age': [33, 44], 'gender': ['M', 'F'], 'job': ['engineer', 'scientist']}

    name  age gender        job
0  peter   33      M   engineer
1  julie   44      F  scientist

In [16]:
data_dict = {'emp_name':['Amal', 'Kamal', 'Bimal'], 'emp_age':[40, 50, 45]}
emp_id = [100, 101, 102]
df = pd.DataFrame(data = data_dict, index = emp_id)
print (df.columns)
print (df.index)
df

Index(['emp_name', 'emp_age'], dtype='object')
Int64Index([100, 101, 102], dtype='int64')

    emp_name  emp_age
100     Amal       40
101    Kamal       50
102    Bimal       45

In [17]:
df = df.reset_index()
df

   index emp_name  emp_age
0    100     Amal       40
1    101    Kamal       50
2    102    Bimal       45

### Concatenate Data Frame

In [18]:
result = user1.append(user2, ignore_index = True)
result

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student
3   paul   58      F  manager

In [19]:
result = user1.append(user2).append(user3, ignore_index = True)
result

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [20]:
users = pd.concat([user1, user2, user3], ignore_index = True)
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

### Join Data Frame

In [21]:
data_dict = dict(name = ['alice', 'john', 'eric', 'julie', 'alex'], height = [165, 180, 175, 171, 169])
print (data_dict)
user4 = pd.DataFrame(data = data_dict)
user4

{'name': ['alice', 'john', 'eric', 'julie', 'alex'], 'height': [165, 180, 175, 171, 169]}

    name  height
0  alice     165
1   john     180
2   eric     175
3  julie     171
4   alex     169

In [22]:
# only mathcing rows
merge_inner = pd.merge(users, user4, on = "name", how = "inner")
merge_inner

    name  age gender        job  height
0  alice   19      F    student     165
1   john   26      M    student     180
2   eric   22      M    student     175
3  julie   44      F  scientist     171

In [23]:
merge_inner = pd.merge(users, user4, on = "name")   # by default inner join
merge_inner

    name  age gender        job  height
0  alice   19      F    student     165
1   john   26      M    student     180
2   eric   22      M    student     175
3  julie   44      F  scientist     171

In [24]:
# all rows from both the tables
merge_outer = pd.merge(users, user4, on = "name", how = "outer")
merge_outer

    name   age gender        job  height
0  alice  19.0      F    student   165.0
1   john  26.0      M    student   180.0
2   eric  22.0      M    student   175.0
3   paul  58.0      F    manager     NaN
4  peter  33.0      M   engineer     NaN
5  julie  44.0      F  scientist   171.0
6   alex   NaN    NaN        NaN   169.0

In [25]:
# all rows from left table and matching rows from the right table
merge_left = pd.merge(users, user4, on = "name", how = "left")
merge_left

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

In [26]:
# all rows from right table and matching rows from the left table
merge_right = pd.merge(users, user4, on = "name", how = "right")
merge_right

    name   age gender        job  height
0  alice  19.0      F    student     165
1   john  26.0      M    student     180
2   eric  22.0      M    student     175
3  julie  44.0      F  scientist     171
4   alex   NaN    NaN        NaN     169

### Summarizing the Data Frame

In [27]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [28]:
print (users.dtypes)
print (users.columns)
print (users.index)
print (f"This DataFrame with shape = {users.shape} and row count = {users.shape[0]} and column count = {users.shape[1]}")
print (users.values, type(users.values))

name      object
age        int64
gender    object
job       object
dtype: object
Index(['name', 'age', 'gender', 'job'], dtype='object')
RangeIndex(start=0, stop=6, step=1)
This DataFrame with shape = (6, 4) and row count = 6 and column count = 4
[['alice' 19 'F' 'student']
 ['john' 26 'M' 'student']
 ['eric' 22 'M' 'student']
 ['paul' 58 'F' 'manager']
 ['peter' 33 'M' 'engineer']
 ['julie' 44 'F' 'scientist']] <class 'numpy.ndarray'>

In [29]:
users.describe()

             age
count   6.000000
mean   33.666667
std    14.895189
min    19.000000
25%    23.000000
50%    29.500000
75%    41.250000
max    58.000000

In [30]:
users.describe(include = ['object'])

        name gender      job
count      6      6        6
unique     6      2        4
top     paul      F  student
freq       1      3        3

In [31]:
users.describe(include = 'all')

        name        age gender      job
count      6   6.000000      6        6
unique     6        NaN      2        4
top     paul        NaN      F  student
freq       1        NaN      3        3
mean     NaN  33.666667    NaN      NaN
std      NaN  14.895189    NaN      NaN
min      NaN  19.000000    NaN      NaN
25%      NaN  23.000000    NaN      NaN
50%      NaN  29.500000    NaN      NaN
75%      NaN  41.250000    NaN      NaN
max      NaN  58.000000    NaN      NaN

In [32]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   gender  6 non-null      object
 3   job     6 non-null      object
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

### Column Selection

In [33]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [34]:
print (users.gender, type(users.gender))

0    F
1    M
2    M
3    F
4    M
5    F
Name: gender, dtype: object <class 'pandas.core.series.Series'>

In [35]:
print (users['gender'], type(users['gender']))

0    F
1    M
2    M
3    F
4    M
5    F
Name: gender, dtype: object <class 'pandas.core.series.Series'>

In [36]:
users[['name', 'gender', 'job']]

    name gender        job
0  alice      F    student
1   john      M    student
2   eric      M    student
3   paul      F    manager
4  peter      M   engineer
5  julie      F  scientist

In [37]:
my_cols = ['name', 'gender', 'job']
users[my_cols]

    name gender        job
0  alice      F    student
1   john      M    student
2   eric      M    student
3   paul      F    manager
4  peter      M   engineer
5  julie      F  scientist

### Row Selection

In [38]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [39]:
print (users.iloc[2])
print (users.loc[2])

name         eric
age            22
gender          M
job       student
Name: 2, dtype: object
name         eric
age            22
gender          M
job       student
Name: 2, dtype: object

In [40]:
print (users.iloc[4][3], users.iloc[4]['job'], users.loc[4][3], users.loc[4]['job'])
print (users.iloc[4, 3], users.iloc[4]['job'], users.loc[4][3], users.loc[4, 'job'])
print (users.shape, users.shape[0], users.shape[1], len(users), users.ndim, users.size)

engineer engineer engineer engineer
engineer engineer engineer engineer
(6, 4) 6 4 6 2 24

In [41]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [42]:
df = users.copy()
for i in range(df.shape[0]):
    row = df.iloc[i]
    # print (row)
    row.age += 100
    # print (row)
    df.iloc[i] = row
df

C:\Users\Arnab\anaconda3\lib\site-packages\pandas\core\generic.py:5494: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

    name  age gender        job
0  alice  119      F    student
1   john  126      M    student
2   eric  122      M    student
3   paul  158      F    manager
4  peter  133      M   engineer
5  julie  144      F  scientist

### Row Selection / Filtering

In [43]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [44]:
users.age < 30   # creating a boolean series

0     True
1     True
2     True
3    False
4    False
5    False
Name: age, dtype: bool

In [45]:
users[users.age < 30]

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student

In [46]:
print (users[users.age < 30].job)
print (users[users.age < 30]['job'])

0    student
1    student
2    student
Name: job, dtype: object
0    student
1    student
2    student
Name: job, dtype: object

In [47]:
users[users.age < 30][['job', 'name', 'age']]

       job   name  age
0  student  alice   19
1  student   john   26
2  student   eric   22

In [48]:
users[users.age < 30][['job', 'name', 'age','gender']]

       job   name  age gender
0  student  alice   19      F
1  student   john   26      M
2  student   eric   22      M

In [49]:
users[(users.age < 30) & (users.gender == 'M')][['job', 'name', 'age','gender']]

       job  name  age gender
1  student  john   26      M
2  student  eric   22      M

In [50]:
users[(users.age < 30) | (users.gender == 'M')][['job', 'name', 'age','gender']]

        job   name  age gender
0   student  alice   19      F
1   student   john   26      M
2   student   eric   22      M
4  engineer  peter   33      M

In [51]:
users[~((users.age < 30) | (users.gender == 'M'))][['job', 'name', 'age','gender']]

         job   name  age gender
3    manager   paul   58      F
5  scientist  julie   44      F

In [52]:
users[users.job.isin(['scientist', 'engineer'])]

    name  age gender        job
4  peter   33      M   engineer
5  julie   44      F  scientist

### Sorting on Data Frame

In [53]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [54]:
df.age.sort_values()

0    19
2    22
1    26
4    33
5    44
3    58
Name: age, dtype: int64

In [55]:
df.age.sort_values(ascending = False)

3    58
5    44
4    33
1    26
2    22
0    19
Name: age, dtype: int64

In [56]:
df.sort_values(by = 'age')

    name  age gender        job
0  alice   19      F    student
2   eric   22      M    student
1   john   26      M    student
4  peter   33      M   engineer
5  julie   44      F  scientist
3   paul   58      F    manager

In [57]:
df.sort_values(by = 'age', ascending = False)

    name  age gender        job
3   paul   58      F    manager
5  julie   44      F  scientist
4  peter   33      M   engineer
1   john   26      M    student
2   eric   22      M    student
0  alice   19      F    student

In [58]:
df = users.copy()
df = df.sort_values(by = ['job', 'age'])
df

    name  age gender        job
4  peter   33      M   engineer
3   paul   58      F    manager
5  julie   44      F  scientist
0  alice   19      F    student
2   eric   22      M    student
1   john   26      M    student

In [59]:
df = users.copy()
df.sort_values(by = ['job', 'age'], inplace = True)
df

    name  age gender        job
4  peter   33      M   engineer
3   paul   58      F    manager
5  julie   44      F  scientist
0  alice   19      F    student
2   eric   22      M    student
1   john   26      M    student

### Reshaping by Pivoting and Unpivoting

**Unpivot Operation -**<br>
Wide Format is human being friendly and Long format is machine friendly<br>
Wide Format (Unstacked Format) -----------------------------------> Long Format (Stacked Format)<br>
                                      
**Pivot Operation -**<br>
Long Format (Stacked Format) -----------------------------------> Wide Format (Unstacked Format)<br>

In [60]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [61]:
# "unpivot" a DataFrame from wide format to long (stacked) format
stacked_df = pd.melt(users, id_vars = "name", var_name = "variable", value_name = "value")
stacked_df

     name variable      value
0   alice      age         19
1    john      age         26
2    eric      age         22
3    paul      age         58
4   peter      age         33
5   julie      age         44
6   alice   gender          F
7    john   gender          M
8    eric   gender          M
9    paul   gender          F
10  peter   gender          M
11  julie   gender          F
12  alice      job    student
13   john      job    student
14   eric      job    student
15   paul      job    manager
16  peter      job   engineer
17  julie      job  scientist

In [62]:
help(pd.melt)

Help on function melt in module pandas.core.reshape.melt:

melt(frame: 'DataFrame', id_vars=None, value_vars=None, var_name=None, value_name='value', col_level=None, ignore_index: bool = True) -> 'DataFrame'
    Unpivot a DataFrame from wide to long format, optionally leaving identifiers set.

    This function is useful to massage a DataFrame into a format where one
    or more columns are identifier variables (`id_vars`), while all other
    columns, considered measured variables (`value_vars`), are "unpivoted" to
    the row axis, leaving just two non-identifier columns, 'variable' and
    'value'.

    Parameters
    ----------
    id_vars : tuple, list, or ndarray, optional
        Column(s) to use as identifier variables.
    value_vars : tuple, list, or ndarray, optional
        Column(s) to unpivot. If not specified, uses all columns that
        are not set as `id_vars`.
    var_name : scalar
        Name to use for the 'variable' column. If None it uses
        ``frame.columns.name`` or 'variable'.
    value_name : scalar, default 'value'
        Name to use for the 'value' column.
    col_level : int or str, optional
        If columns are a MultiIndex then use this level to melt.
    ignore_index : bool, default True
        If True, original index is ignored. If False, the original index is retained.
        Index labels will be repeated as necessary.

        .. versionadded:: 1.1.0

    Returns
    -------
    DataFrame
        Unpivoted DataFrame.

    See Also
    --------
    DataFrame.melt : Identical method.
    pivot_table : Create a spreadsheet-style pivot table as a DataFrame.
    DataFrame.pivot : Return reshaped DataFrame organized
        by given index / column values.
    DataFrame.explode : Explode a DataFrame from list-like
            columns to long format.

    Examples
    --------
    >>> df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
    ...                    'B': {0: 1, 1: 3, 2: 5},
    ...                    'C': {0: 2, 1: 4, 2: 6}})
    >>> df
       A  B  C
    0  a  1  2
    1  b  3  4
    2  c  5  6

    >>> pd.melt(df, id_vars=['A'], value_vars=['B'])
       A variable  value
    0  a        B      1
    1  b        B      3
    2  c        B      5

    >>> pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])
       A variable  value
    0  a        B      1
    1  b        B      3
    2  c        B      5
    3  a        C      2
    4  b        C      4
    5  c        C      6

    The names of 'variable' and 'value' columns can be customized:

    >>> pd.melt(df, id_vars=['A'], value_vars=['B'],
    ...         var_name='myVarname', value_name='myValname')
       A myVarname  myValname
    0  a         B          1
    1  b         B          3
    2  c         B          5

    Original index values can be kept around:

    >>> pd.melt(df, id_vars=['A'], value_vars=['B', 'C'], ignore_index=False)
       A variable  value
    0  a        B      1
    1  b        B      3
    2  c        B      5
    0  a        C      2
    1  b        C      4
    2  c        C      6

    If you have multi-index columns:

    >>> df.columns = [list('ABC'), list('DEF')]
    >>> df
       A  B  C
       D  E  F
    0  a  1  2
    1  b  3  4
    2  c  5  6

    >>> pd.melt(df, col_level=0, id_vars=['A'], value_vars=['B'])
       A variable  value
    0  a        B      1
    1  b        B      3
    2  c        B      5

    >>> pd.melt(df, id_vars=[('A', 'D')], value_vars=[('B', 'E')])
      (A, D) variable_0 variable_1  value
    0      a          B          E      1
    1      b          B          E      3
    2      c          B          E      5

In [63]:
unstacked_df = stacked_df.pivot(index = 'name', columns = 'variable', values = 'value')
unstacked_df

variable age gender        job
name
alice     19      F    student
eric      22      M    student
john      26      M    student
julie     44      F  scientist
paul      58      F    manager
peter     33      M   engineer

In [64]:
unstacked_df = unstacked_df.reset_index()
unstacked_df

variable   name age gender        job
0         alice  19      F    student
1          eric  22      M    student
2          john  26      M    student
3         julie  44      F  scientist
4          paul  58      F    manager
5         peter  33      M   engineer

In [65]:
print (unstacked_df.columns)
print (unstacked_df.columns.name)
unstacked_df.columns.name = ""
unstacked_df

Index(['name', 'age', 'gender', 'job'], dtype='object', name='variable')
variable

    name age gender        job
0  alice  19      F    student
1   eric  22      M    student
2   john  26      M    student
3  julie  44      F  scientist
4   paul  58      F    manager
5  peter  33      M   engineer

### Reading Data From Different Sources

In [66]:
try:
    df_csv = pd.read_csv("salary_table.csv")
    print ("The CSV files has been read successfully...")
except:
    print ("File access ERROR !!!")

The CSV files has been read successfully...

In [67]:
df_csv.head(4)

   salary  experience education management
0   13876           1  Bachelor          Y
1   11608           1      Ph.D          N
2   18701           1      Ph.D          Y
3   11283           1    Master          N

In [68]:
df_csv.tail(4)

    salary  experience education management
42   18838          16    Master          N
43   17483          16  Bachelor          N
44   19207          17    Master          N
45   19346          20  Bachelor          N

In [69]:
df_csv.sample(4)

    salary  experience education management
45   19346          20  Bachelor          N
29   14467          10  Bachelor          N
18   13677           5      Ph.D          N
40   25685          15      Ph.D          Y

In [70]:
df_csv

    salary  experience education management
0    13876           1  Bachelor          Y
1    11608           1      Ph.D          N
2    18701           1      Ph.D          Y
3    11283           1    Master          N
4    11767           1      Ph.D          N
5    20872           2    Master          Y
6    11772           2    Master          N
7    10535           2  Bachelor          N
8    12195           2      Ph.D          N
9    12313           3    Master          N
10   14975           3  Bachelor          Y
11   21371           3    Master          Y
12   19800           3      Ph.D          Y
13   11417           4  Bachelor          N
14   20263           4      Ph.D          Y
15   13231           4      Ph.D          N
16   12884           4    Master          N
17   13245           5    Master          N
18   13677           5      Ph.D          N
19   15965           5  Bachelor          Y
20   12336           6  Bachelor          N
21   21352           6      Ph.D          Y
22   13839           6    Master          N
23   22884           6    Master          Y
24   16978           7  Bachelor          Y
25   14803           8    Master          N
26   17404           8  Bachelor          Y
27   22184           8      Ph.D          Y
28   13548           8  Bachelor          N
29   14467          10  Bachelor          N
30   15942          10    Master          N
31   23174          10      Ph.D          Y
32   23780          10    Master          Y
33   25410          11    Master          Y
34   14861          11  Bachelor          N
35   16882          12    Master          N
36   24170          12      Ph.D          Y
37   15990          13  Bachelor          N
38   26330          13    Master          Y
39   17949          14    Master          N
40   25685          15      Ph.D          Y
41   27837          16    Master          Y
42   18838          16    Master          N
43   17483          16  Bachelor          N
44   19207          17    Master          N
45   19346          20  Bachelor          N

In [71]:
try:
    df_xlsx = pd.read_excel('salary_table.xlsx')
    print ("The XLSX files has been read successfully...")
except:
    print ("File access ERROR !!!")

The XLSX files has been read successfully...

In [72]:
df_xlsx.head()

   salary  experience education management
0   13876           1  Bachelor          Y
1   11608           1      Ph.D          N
2   18701           1      Ph.D          Y
3   11283           1    Master          N
4   11767           1      Ph.D          N

In [73]:
try:
    df_xlsx = pd.read_excel('salary_table.xlsx', sheet_name = 'salary_table')
    print ("The XLSX files has been read successfully...")
except:
    print ("File access ERROR !!!")

The XLSX files has been read successfully...

In [74]:
df_xlsx.head()

   salary  experience education management
0   13876           1  Bachelor          Y
1   11608           1      Ph.D          N
2   18701           1      Ph.D          Y
3   11283           1    Master          N
4   11767           1      Ph.D          N

In [75]:
try:
    # df_xlsx = pd.read_excel('C:\\Users\Arnab\Yokogawa_AI\salary_table.xlsx', sheet_name = 'salary_table_modified')
    # df_xlsx = pd.read_excel('C:\\Users\\Arnab\\Yokogawa_AI\\salary_table.xlsx', sheet_name = 'salary_table_modified')
    # df_xlsx = pd.read_excel('C:/Users/Arnab/Yokogawa_AI/salary_table.xlsx', sheet_name = 'salary_table_modified')
    df_xlsx = pd.read_excel('C://Users//Arnab//Yokogawa_AI//SALARY_TABLe.xlsx', sheet_name = 'salary_table_modified')
    print ("The XLSX files has been read successfully...")
except:
    print ("File access ERROR !!!")

The XLSX files has been read successfully...

In [76]:
df_xlsx.head()

   SALARY  EXPERIENCE EDUCATION MANAGEMENT
0   13876           1  Bachelor          Y
1   11608           1      Ph.D          N
2   18701           1      Ph.D          Y
3   11283           1    Master          N
4   11767           1      Ph.D          N

### Quality Control: Duplicate Data

In [78]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [79]:
users.iloc[0]

name        alice
age            19
gender          F
job       student
Name: 0, dtype: object

In [81]:
df = users.append(users.iloc[0])
df = df.append(users.iloc[1], ignore_index=True)
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist
6  alice   19      F    student
7   john   26      M    student

In [84]:
print (df.duplicated())
df[df.duplicated()]

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7     True
dtype: bool

    name  age gender      job
6  alice   19      F  student
7   john   26      M  student

In [85]:
df[~df.duplicated()]

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [89]:
print (df.duplicated(['gender']))
print (df.duplicated(['job', 'gender']))
print (f"So number of duplicated records is {df.duplicated(['job', 'gender']).sum()}")
df[df.duplicated(['job', 'gender'])]

0    False
1    False
2     True
3     True
4     True
5     True
6     True
7     True
dtype: bool
0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
dtype: bool
So number of duplicated records is 3

    name  age gender      job
2   eric   22      M  student
6  alice   19      F  student
7   john   26      M  student

In [90]:
df.drop_duplicates(inplace=True)
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

### Quality Control: Missing Data

In [93]:
df = merge_left.copy()
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

In [94]:
df.describe(include='all')

        name        age gender      job      height
count      6   6.000000      6        6    4.000000
unique     6        NaN      2        4         NaN
top     paul        NaN      F  student         NaN
freq       1        NaN      3        3         NaN
mean     NaN  33.666667    NaN      NaN  172.750000
std      NaN  14.895189    NaN      NaN    6.344289
min      NaN  19.000000    NaN      NaN  165.000000
25%      NaN  23.000000    NaN      NaN  169.500000
50%      NaN  29.500000    NaN      NaN  173.000000
75%      NaN  41.250000    NaN      NaN  176.250000
max      NaN  58.000000    NaN      NaN  180.000000

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   gender  6 non-null      object
 3   job     6 non-null      object
 4   height  4 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 288.0+ bytes

In [104]:
print (df.height.isnull(), "and count =", df.height.isnull().sum())
print (~df.height.isnull())
print (df.height.notnull(), "and count =", df.height.notnull().sum())

0    False
1    False
2    False
3     True
4     True
5    False
Name: height, dtype: bool and count = 2
0     True
1     True
2     True
3    False
4    False
5     True
Name: height, dtype: bool
0     True
1     True
2     True
3    False
4    False
5     True
Name: height, dtype: bool and count = 4

In [100]:
df[df.height.isnull()]

    name  age gender       job  height
3   paul   58      F   manager     NaN
4  peter   33      M  engineer     NaN

In [101]:
df[df.height.notnull()]

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
5  julie   44      F  scientist   171.0

In [105]:
df.isnull()

    name    age  gender    job  height
0  False  False   False  False   False
1  False  False   False  False   False
2  False  False   False  False   False
3  False  False   False  False    True
4  False  False   False  False    True
5  False  False   False  False   False

In [106]:
df.notnull()

   name   age  gender   job  height
0  True  True    True  True    True
1  True  True    True  True    True
2  True  True    True  True    True
3  True  True    True  True   False
4  True  True    True  True   False
5  True  True    True  True    True

In [109]:
# Strategy 1: drop missing values
df.dropna(inplace=True)

In [110]:
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
5  julie   44      F  scientist   171.0

In [113]:
df = merge_left.copy()
df.dropna(how = 'all')
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

In [133]:
merge_left

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

In [134]:
user1 = merge_left.append(pd.Series(data=['alex',np.nan,'M','student',np.nan], index=['name','age','gender','job','height']), ignore_index=True)
df = user1.copy()
df

    name   age gender        job  height
0  alice  19.0      F    student   165.0
1   john  26.0      M    student   180.0
2   eric  22.0      M    student   175.0
3   paul  58.0      F    manager     NaN
4  peter  33.0      M   engineer     NaN
5  julie  44.0      F  scientist   171.0
6   alex   NaN      M    student     NaN

In [143]:
df = df[(df['age'].notnull()) & (df['height'].notnull())]
df

    name   age gender        job  height
0  alice  19.0      F    student   165.0
1   john  26.0      M    student   180.0
2   eric  22.0      M    student   175.0
5  julie  44.0      F  scientist   171.0

In [154]:
# Strategy 2: fill in missing values
df = merge_left.copy()
mean_height = df.height.mean()
print ("Mean of the height is", mean_height)
df.loc[df.height.isnull(), 'height'] = mean_height
df

Mean of the height is 172.75

    name  age gender        job  height
0  alice   19      F    student  165.00
1   john   26      M    student  180.00
2   eric   22      M    student  175.00
3   paul   58      F    manager  172.75
4  peter   33      M   engineer  172.75
5  julie   44      F  scientist  171.00

In [156]:
df = merge_left.copy()
df = df.fillna(0)
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     0.0
4  peter   33      M   engineer     0.0
5  julie   44      F  scientist   171.0

In [157]:
df = merge_left.copy()
df = df.fillna(df.height.mean())
df

    name  age gender        job  height
0  alice   19      F    student  165.00
1   john   26      M    student  180.00
2   eric   22      M    student  175.00
3   paul   58      F    manager  172.75
4  peter   33      M   engineer  172.75
5  julie   44      F  scientist  171.00

In [158]:
df = merge_left.copy()
print (df)
df = df.fillna(method = 'pad')
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager   175.0
4  peter   33      M   engineer   175.0
5  julie   44      F  scientist   171.0

In [159]:
df = merge_left.copy()
print (df)
df = df.fillna(method = 'bfill')
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager   171.0
4  peter   33      M   engineer   171.0
5  julie   44      F  scientist   171.0

### Rename Columns

In [160]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [161]:
new_column_names = ['new_name', 'new_age', 'new_gender', 'new_job']
print (df.columns)
df.columns = new_column_names
print (df.columns)
df

Index(['name', 'age', 'gender', 'job'], dtype='object')
Index(['new_name', 'new_age', 'new_gender', 'new_job'], dtype='object')

  new_name  new_age new_gender    new_job
0    alice       19          F    student
1     john       26          M    student
2     eric       22          M    student
3     paul       58          F    manager
4    peter       33          M   engineer
5    julie       44          F  scientist

In [165]:
df.rename(columns = {'new_name':'my_name'}, inplace = True)
df

  my_name  new_age new_gender    new_job
0   alice       19          F    student
1    john       26          M    student
2    eric       22          M    student
3    paul       58          F    manager
4   peter       33          M   engineer
5   julie       44          F  scientist

### Group By

In [169]:
df = pd.read_csv("salary_table.csv")
print (df.shape)
df.head()

(46, 4)

   salary  experience education management
0   13876           1  Bachelor          Y
1   11608           1      Ph.D          N
2   18701           1      Ph.D          Y
3   11283           1    Master          N
4   11767           1      Ph.D          N

In [172]:
for group, data_frame in df.groupby("education"):
    print ("Group:", group, type(group))
    print (type(data_frame))
    print (data_frame)

Group: Bachelor <class 'str'>
<class 'pandas.core.frame.DataFrame'>
    salary  experience education management
0    13876           1  Bachelor          Y
7    10535           2  Bachelor          N
10   14975           3  Bachelor          Y
13   11417           4  Bachelor          N
19   15965           5  Bachelor          Y
20   12336           6  Bachelor          N
24   16978           7  Bachelor          Y
26   17404           8  Bachelor          Y
28   13548           8  Bachelor          N
29   14467          10  Bachelor          N
34   14861          11  Bachelor          N
37   15990          13  Bachelor          N
43   17483          16  Bachelor          N
45   19346          20  Bachelor          N
Group: Master <class 'str'>
<class 'pandas.core.frame.DataFrame'>
    salary  experience education management
3    11283           1    Master          N
5    20872           2    Master          Y
6    11772           2    Master          N
9    12313           3    Master          N
11   21371           3    Master          Y
16   12884           4    Master          N
17   13245           5    Master          N
22   13839           6    Master          N
23   22884           6    Master          Y
25   14803           8    Master          N
30   15942          10    Master          N
32   23780          10    Master          Y
33   25410          11    Master          Y
35   16882          12    Master          N
38   26330          13    Master          Y
39   17949          14    Master          N
41   27837          16    Master          Y
42   18838          16    Master          N
44   19207          17    Master          N
Group: Ph.D <class 'str'>
<class 'pandas.core.frame.DataFrame'>
    salary  experience education management
1    11608           1      Ph.D          N
2    18701           1      Ph.D          Y
4    11767           1      Ph.D          N
8    12195           2      Ph.D          N
12   19800           3      Ph.D          Y
14   20263           4      Ph.D          Y
15   13231           4      Ph.D          N
18   13677           5      Ph.D          N
21   21352           6      Ph.D          Y
27   22184           8      Ph.D          Y
31   23174          10      Ph.D          Y
36   24170          12      Ph.D          Y
40   25685          15      Ph.D          Y

In [173]:
for group, data_frame in df.groupby(["education", "management"]):
    print ("Group:", group, type(group))
    print (type(data_frame))
    print (data_frame)

Group: ('Bachelor', 'N') <class 'tuple'>
<class 'pandas.core.frame.DataFrame'>
    salary  experience education management
7    10535           2  Bachelor          N
13   11417           4  Bachelor          N
20   12336           6  Bachelor          N
28   13548           8  Bachelor          N
29   14467          10  Bachelor          N
34   14861          11  Bachelor          N
37   15990          13  Bachelor          N
43   17483          16  Bachelor          N
45   19346          20  Bachelor          N
Group: ('Bachelor', 'Y') <class 'tuple'>
<class 'pandas.core.frame.DataFrame'>
    salary  experience education management
0    13876           1  Bachelor          Y
10   14975           3  Bachelor          Y
19   15965           5  Bachelor          Y
24   16978           7  Bachelor          Y
26   17404           8  Bachelor          Y
Group: ('Master', 'N') <class 'tuple'>
<class 'pandas.core.frame.DataFrame'>
    salary  experience education management
3    11283           1    Master          N
6    11772           2    Master          N
9    12313           3    Master          N
16   12884           4    Master          N
17   13245           5    Master          N
22   13839           6    Master          N
25   14803           8    Master          N
30   15942          10    Master          N
35   16882          12    Master          N
39   17949          14    Master          N
42   18838          16    Master          N
44   19207          17    Master          N
Group: ('Master', 'Y') <class 'tuple'>
<class 'pandas.core.frame.DataFrame'>
    salary  experience education management
5    20872           2    Master          Y
11   21371           3    Master          Y
23   22884           6    Master          Y
32   23780          10    Master          Y
33   25410          11    Master          Y
38   26330          13    Master          Y
41   27837          16    Master          Y
Group: ('Ph.D', 'N') <class 'tuple'>
<class 'pandas.core.frame.DataFrame'>
    salary  experience education management
1    11608           1      Ph.D          N
4    11767           1      Ph.D          N
8    12195           2      Ph.D          N
15   13231           4      Ph.D          N
18   13677           5      Ph.D          N
Group: ('Ph.D', 'Y') <class 'tuple'>
<class 'pandas.core.frame.DataFrame'>
    salary  experience education management
2    18701           1      Ph.D          Y
12   19800           3      Ph.D          Y
14   20263           4      Ph.D          Y
21   21352           6      Ph.D          Y
27   22184           8      Ph.D          Y
31   23174          10      Ph.D          Y
36   24170          12      Ph.D          Y
40   25685          15      Ph.D          Y